{
  "architectures": [
    "DeepseekV4ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "compress_rates": {
    "compressed_sparse_attention": 4,
    "heavily_compressed_attention": 8
  },
  "compress_rope_theta": 160000.0,
  "eos_token_id": 1,
  "hc_eps": 1e-06,
  "hc_mult": 2,
  "hc_sinkhorn_iters": 20,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 256,
  "index_head_dim": 32,
  "index_n_heads": 4,
  "index_topk": 16,
  "initializer_range": 0.02,
  "layer_types": [
    "heavily_compressed_attention",
    "compressed_sparse_attention",
    "heavily_compressed_attention"
  ],
  "max_position_embeddings": 512,
  "mlp_bias": false,
  "mlp_layer_types": [
    "hash_moe",
    "moe",
    "moe"
  ],
  "model_type": "deepseek_v4",
  "moe_intermediate_size": 128,
  "n_routed_experts": 8,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 8,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 3,
  "num_key_value_heads": 1,
  "num_nextn_predict_layers": 1,
  "o_groups": 4,
  "o_lora_rank": 64,
  "output_router_logits": false,
  "pad_token_id": null,
  "partial_rotary_factor": 0.25,
  "q_lora_rank": 128,
  "rms_norm_eps": 1e-06,
  "rope_theta": 10000.0,
  "routed_scaling_factor": 1.5,
  "router_aux_loss_coef": 0.001,
  "router_jitter_noise": 0.0,
  "scoring_func": "sqrtsoftplus",
  "sliding_window": 128,
  "swiglu_limit": 10.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "5.9.0",
  "use_cache": true,
  "vocab_size": 4096
}
